### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.apim.azurerm_api_management_policy_fragment.auth will be updated in-place
  ~ resource "azurerm_api_management_policy_fragment" "auth" {
        id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/policyFragments/io-com-app-session-fragment"
        name              = "io-com-app-session-fragment"
      ~ value             = <<-EOT
          - <fragment>
          - 	<!-- Extract the token from the Authorization Header -->
          - 	<set-variable name="token" value="@{     string[] values;     return context.Request.Headers.TryGetValue(&quot;Authorization&quot;, out values) ? values.FirstOrDefault() : &quot;&quot;;   }" />
          - 	<!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          - 	<choose>
          - 		<when condition="@(       string.IsNullOrEmpty((string)context.Variables[&quot;token&quot;]) ||       !(((string)context.Variables[&quot;token&quot;]).StartsWith(&quot;Bearer &quot;, StringComparison.OrdinalIgnoreCase)) ||       string.IsNullOrWhiteSpace(((string)context.Variables[&quot;token&quot;]).Substring(7))     )">
          - 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          - 			</set-header>
          - 			<return-response>
          - 				<set-status code="401" reason="Unauthorized" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          - 		</when>
          - 	</choose>
          - 	<!-- Call the session manager, pasing the bearer token, to get the user identity -->
          - 	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          - 		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          - 		<set-method>GET</set-method>
          - 		<set-header name="Content-Type" exists-action="override">
          - 			<value>application/json</value>
          - 		</set-header>
          - 		<set-header name="Authorization" exists-action="override">
          - 			<value>@(((string)context.Variables["token"]))</value>
          - 		</set-header>
          - 	</send-request>
          - 	<choose>
          - 		<!-- If 200 return set the x-user header as the base64 of the response -->
          - 		<when condition="@(((IResponse)context.Variables[&quot;introspectionResponse&quot;]).StatusCode == 200)">
          - 			<!-- Parse the introspectionResponse as a string -->
          - 			<set-variable name="userData" value="@(((IResponse)context.Variables[&quot;introspectionResponse&quot;]).Body.As&lt;string&gt;())" />
          - 			<!-- Remove the Authorization Header -->
          - 			<set-header name="Authorization" exists-action="delete" />
          - 			<!-- Set the x-user header with the user data -->
          - 			<set-header name="x-user" exists-action="override">
          - 				<value>@(
          -           Convert.ToBase64String(
          -               System.Text.Encoding.UTF8.GetBytes(((string)context.Variables["userData"]))
          -           )
          -         )</value>
          - 			</set-header>
          - 		</when>
          - 		<when condition="@(((IResponse)context.Variables[&quot;introspectionResponse&quot;]).StatusCode == 401)">
          - 			<return-response response-variable-name="introspectionErrorResponse">
          - 				<set-status code="401" reason="Unauthorized" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          - 		</when>
          - 		<otherwise>
          - 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          - 			</set-header>
          - 			<return-response response-variable-name="introspectionErrorResponse">
          - 				<set-status code="500" reason="Internal Server Error" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          - 		</otherwise>
          - 	</choose>
          + <fragment>
          + 	<!-- Extract the token from the Authorization Header -->
          +   <set-variable name="token" value='@{
          +     string[] values;
          +     return context.Request.Headers.TryGetValue("Authorization", out values) ? values.FirstOrDefault() : "";
          +   }' />
          + 
          +   <!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          +   <choose>
          +     <when condition='@(
          +       string.IsNullOrEmpty((string)context.Variables["token"]) ||
          +       !(((string)context.Variables["token"]).StartsWith("Bearer ", StringComparison.OrdinalIgnoreCase)) ||
          +       string.IsNullOrWhiteSpace(((string)context.Variables["token"]).Substring(7))
          +     )'>
          +       <set-header name="Content-Type" exists-action="override">
          +         <value>application/json</value>
          +       </set-header>
          +       <return-response>
          +         <set-status code="401" reason="Unauthorized" />
          +         <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          +       </return-response>
          +   </when>
          +   </choose>
          + 
          +   <!-- Call the session manager, pasing the bearer token, to get the user identity -->
          + 	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          + 		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          + 		<set-method>GET</set-method>
          + 		<set-header name="Content-Type" exists-action="override">
          +       <value>application/json</value>
          + 		</set-header>
          + 		<set-header name="Authorization" exists-action="override">
          +       <value>@(((string)context.Variables["token"]))</value>
          + 		</set-header>
          + 	</send-request>
          + 
          + 	<choose>
          +     <!-- If 200 return set the x-user header as the base64 of the response -->
          + 		<when condition='@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 200)'>
          + 			<!-- Parse the introspectionResponse as a string -->
          + 			<set-variable name="userData" value='@(((IResponse)context.Variables["introspectionResponse"]).Body.As&lt;string&gt;())' />
          + 			<!-- Remove the Authorization Header -->
          + 			<set-header name="Authorization" exists-action="delete" />
          + 			<!-- Set the x-user header with the user data -->
          + 			<set-header name="x-user" exists-action="override">
          + 				<value>@(
          +           Convert.ToBase64String(
          +               System.Text.Encoding.UTF8.GetBytes(((string)context.Variables["userData"]))
          +           )
          +         )</value>
          + 			</set-header>
          + 		</when>
          + 
          + 		<when condition='@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 401)'>
          + 			<return-response response-variable-name="introspectionErrorResponse">
          + 				<set-status code="401" reason="Unauthorized" />
          +           <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          + 			</return-response>
          + 		</when>
          + 
          + 		<otherwise>
          + 			<set-header name="Content-Type" exists-action="override">
          +         <value>application/json</value>
          + 			</set-header>
          + 			<return-response response-variable-name="introspectionErrorResponse">
          + 				<set-status code="500" reason="Internal Server Error" />
          +           <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          +         </return-response>
          + 		</otherwise>
          + 	</choose>
            </fragment>
        EOT
        # (3 unchanged attributes hidden)
    }

  # module.web_apps.azurerm_key_vault_access_policy.send_func_kv_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "send_func_kv_access_policy" {
      ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common/objectId/9fc86370-bb43-435b-bcbe-152726cef56b" -> (known after apply)
      - key_permissions         = [] -> null
      ~ key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-com-kv-01" # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.web_apps.azurerm_role_assignment.key_vault_send_func_secrets_user must be replaced
-/+ resource "azurerm_role_assignment" "key_vault_send_func_secrets_user" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common/providers/Microsoft.Authorization/roleAssignments/1f2c2093-84c7-9d82-5c39-13408b53f27e" -> (known after apply)
      ~ name                                   = "1f2c2093-84c7-9d82-5c39-13408b53f27e" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      ~ scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-com-kv-01" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.web_apps.module.send_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "LOLLIPOP_API_BASE_URL"                                                                            = "https://io-p-itn-auth-lollipop-func-02.azurewebsites.net/api/v1"
          + "LOLLIPOP_FUNC_KEY"                                                                                = "@Microsoft.KeyVault(VaultName=io-p-itn-com-kv-01;SecretName=lollipop-func-key)"
          + "NOTIFICATION_CLIENT_API_KEY"                                                                      = "@Microsoft.KeyVault(VaultName=io-p-itn-com-kv-01;SecretName=send-aar-notification-prod-key)"
          + "NOTIFICATION_CLIENT_BASE_URL"                                                                     = "https://api-io.pn.pagopa.it"
          + "NOTIFICATION_CLIENT_UAT_API_KEY"                                                                  = "@Microsoft.KeyVault(VaultName=io-p-itn-com-kv-01;SecretName=send-aar-notification-uat-key)"
          + "NOTIFICATION_CLIENT_UAT_BASE_URL"                                                                 = "https://api-io.uat.pn.pagopa.it"
            # (14 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-send-func-01"
        name                                           = "io-p-itn-com-send-func-01"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Comunicazione"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "1.0.1"
            "Source"                                 = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-resource-id" = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps.module.send_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "LOLLIPOP_API_BASE_URL"                                                                            = "https://io-p-itn-auth-lollipop-func-02.azurewebsites.net/api/v1"
          + "LOLLIPOP_FUNC_KEY"                                                                                = "@Microsoft.KeyVault(VaultName=io-p-itn-com-kv-01;SecretName=lollipop-func-key)"
          + "NOTIFICATION_CLIENT_API_KEY"                                                                      = "@Microsoft.KeyVault(VaultName=io-p-itn-com-kv-01;SecretName=send-aar-notification-prod-key)"
          + "NOTIFICATION_CLIENT_BASE_URL"                                                                     = "https://api-io.pn.pagopa.it"
          + "NOTIFICATION_CLIENT_UAT_API_KEY"                                                                  = "@Microsoft.KeyVault(VaultName=io-p-itn-com-kv-01;SecretName=send-aar-notification-uat-key)"
          + "NOTIFICATION_CLIENT_UAT_BASE_URL"                                                                 = "https://api-io.uat.pn.pagopa.it"
            # (15 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-send-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.0.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.
```

</details>
